app/controllers/personas_controller.rb

  def index
    @personas = Persona.all
---
SELECT "personas".* FROM "personas"

  def create
    @persona = Persona.new(persona_params)
sss
    respond_to do |format|
      if @persona.save
---
INSERT INTO "personas" ("codigo", "created_at", "updated_at") VALUES (?, ?, ?)  [["codigo", "1"], ["created_at", "2015-04-13 13:00:54.746723"], ["updated_at", "2015-04-13 13:00:54.746723"]]

    def set_persona
      @persona = Persona.find(params[:id])
---
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", 1]]