app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "comida"], ["text", "hambre"], ["created_at", "2015-04-13 12:47:39.705723"], ["updated_at", "2015-04-13 12:47:39.705723"]]

  def show
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

  def update
      @post = Post.find(params[:id])
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "Esto es el texto"], ["updated_at", "2015-04-13 11:56:25.594387"], ["id", 1]]